import streamlit as st

def home_page():
    st.set_page_config(page_title="Hand Gesture Volume Control")

    st.title("Hand Gesture Volume Control")

    st.header("วัตถุประสงค์เพื่อศึกษา")
    st.write("1). พัฒนาตัวแบบระบบตรวจับนิ้วมือ เพื่อใช้ในการ ปรับค่าแสงหน้าจอแสดงผล")
    st.write("2). เพื่อหาประสิทธิภาพของ ตัวแบบระบบตรวจจับมือเรียนรู้ของเครื่องร่วมกับการตรวจจับ วัตถุ ข้อมูลที่ใช้ในการ เรียนรู้ของเครื่อง คือ โดยการจับจุดจากนิ้วมือเพื่อแสดงตำแหน่งแต่ละจุดของนิ้วมือ")

    st.header("เหตุผล")
    st.write("การจับกาหรือขยับมือเพื่อปรับแสงอาจมีเหตุผลหลายประการ เช่น")
    st.write("การปรับตัวกับแสง: เมื่อมีการเปลี่ยนแปลงของแสง เช่น แสงสว่างหรือแสงที่มืดลง เรามักจะปรับตัวเพื่อให้สามารถมองเห็นได้ชัดเจนมากขึ้น การจับกาหรือขยับมือในที่นี้อาจช่วยปรับตัวหรือปรับเปลี่ยนท่าทางของร่างกายเพื่อให้สามารถรับแสงได้อย่างเหมาะสมกับสภาพแวดล้อมที่มืดหรือสว่างขึ้น")
    st.write("การสื่อสารทางร่างกาย: การใช้การจับกาหรือขยับมือเพื่อปรับแสงอาจเป็นส่วนหนึ่งของการสื่อสารทางร่างกาย เช่น เมื่อมีแสงสว่างเข้มที่มาทันที การปิดดวงตาหรือการใช้มือบดบังแสงอาจเป็นการสื่อสารว่าสภาพแวดล้อมมีการเปลี่ยนแปลง")

    st.header("หลักการ")
    st.write("การขยับของนิ้วมือในการปรับแสงเกี่ยวข้องกับระบบการรับรู้แสงและการประมวลผลของสมองที่ทำให้มนุษย์สามารถปรับตัวต่อการเปลี่ยนแปลงของแสงได้ มีหลายประการที่เกี่ยวข้องกับหลักการนี้: การรับรู้แสงโดยตรง: นิ้วมือและมือมนุษย์มีความสามารถในการรับรู้แสง โดยการรับรู้การเปลี่ยนแปลงของแสงและเงื่อนไขแสงที่แตกต่างกัน เช่น การเข้าแสงจากแหล่งแสงต่าง ๆ การสว่างและมืด ซึ่งส่งผลให้นิ้วมือสามารถปรับตัวต่อเงื่อนไขแสงได้โดยการเปิดหรือปิดตัวของตัวรับรู้แสง เช่น ตาหรือผิวหนังที่ใช้ในการรับรู้แสง การปรับตัวต่อการเปลี่ยนแปลงของแสง: นิ้วมือสามารถเปลี่ยนแปลงการที่เป็นไปได้ต่อการเปลี่ยนแปลงของแสง เช่น การปรับมือเพื่อลดแสงที่มาจากแหล่งแสงสูง เพื่อป้องกันการเจ็บตาหรือการปรับตัวที่เกี่ยวข้องกับการเห็นในสภาพแสงที่แตกต่างกัน")

    st.header("ทฤษฏี")
    st.write("2.1 ปัญญาประดิษฐ์ (Artificial Intelligence) เป็นเทคโนโลยีที่จำลองความฉลาดของมนุษย์ โดยการพัฒนาระบบ อัจฉริยะที่มีความสามารถในการรับรู้ เรียนรู้ใช้เหตุผลและตัดสินใจเลือกทางเลือกที่ดีสุดจากการวิเคราะห์ข้อมูลที่ เกี่ยวข้องพิจารณาทางเลือกต่างๆ")
    st.write("2.2 Machine Learning หรือ การเรียนรู้ของเครื่อง เป็นสาขาหนึ่งของปัญญาประดิษฐ์ (Artificial Intelligence) การ ที่จะพัฒนาให้ระบบมีความฉลาด และความสามารถ ระบบจำเป็นที่จะต้องมีการเรียนรู้สถานการณ์ เพื่อที่จะได้วางแผนและ ตัดสินใจแก้ปัญหาได้เหมือนกับมนุษย์ ")
    st.write("2.3 การวิเคราะห์การถดถอยเชิงเส้น (Linear Regression) เป็น Machine Learning ประเภท Supervised Learning หรือ การเรียนรู้แบบมีผู้สอน ชนิดแบบ Statistical Regression ที่เราจะต้องใส่ชุดข้อมูลเข้าไปให้โปรแกรมเรียนรู้ ก่อน โดยโปรแกรมจะนำตัวแปรต้นและตัวแปรตามไปคำนวณด้วยสถิติทางคณิตศาสตร์ แล้วก็จะได้ข้อมูลกลับมาเป็นตัวเลข")

home_page()

